; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	image2 - mode
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star2 - direction
	GroundStation0 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star9 thermograph0)
	(have_image Star10 spectrograph1)
	(have_image Planet11 thermograph0)
	(have_image Star12 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 planet11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
3. (turn_to satellite0 star2 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 planet11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
6. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 1 of 5
7. (turn_to satellite0 star1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star1)
   goals met: 2 of 5
8. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
9. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 5
10. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 3 of 5
11. (turn_to satellite0 star12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star12)
   goals met: 2 of 5
12. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 3 of 5
13. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 4 of 5
14. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 3 of 5
15. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 4 of 5
16. (turn_to satellite0 star1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star1)
   goals met: 5 of 5
